//연산자!!!
/*
    1개 이상의 피연산자와 함께 사용해서 계산을 하는 특수기호나 문구.
    [산술연산자]
    4칙연산. 나누기 or 곱하기 -> 키보드에 없지만 사용 가능

    + - * /
 */
console.log("1+1 = ", 1 + 1);
console.log("2-3 = ", 2 - 3);
console.log("2*3 = ", 2 * 3);
console.log("2/3 = ", 2 / 3);

// %, **
console.log("100/8 = ", 100 / 8);
console.log("100%8 = ", 100 % 8); //나머지
console.log("2**3 = ", 2 ** 3); //거듭제곱 (2의 몇 승) <-- 2의3 제곱
console.log("2 ** 0.5 = ", 2 ** 0.5); //루트
console.log("2 ** (1/3) = ", 2 ** (1 / 3));
// ()를 통해서 명시적으로 먼저 계산할 수 있다.

//연산자에는 각각의 우선순위들이 있는데 일반적으로 외우기보다는 ()를 통해서 먼저 계산하게 하면 된다.
